# OLDAddLoadHangPoint

## Description
Adds hang point of the speciafied load for the parametric object

```pascal
PROCEDURE OLDAddLoadHangPoint(
				handle    : HANDLE;
				loadIndex : INTEGER;
				point     : VECTOR;
				hasLoad   : BOOLEAN);
```

```python
def vs.OLDAddLoadHangPoint(handle, loadIndex, point, hasLoad):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|loadIndex|INTEGER|   |
|point|VECTOR|   |
|hasLoad|BOOLEAN|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis